In [1]:
import pandas as pd

In [2]:
from sklearn.ensemble import RandomForestRegressor

In [36]:
!pip install category_encoders

Requirement already satisfied: category_encoders in /home/hironu/anaconda3/lib/python3.7/site-packages (2.1.0)
Requirement already satisfied: scikit-learn>=0.20.0 in /home/hironu/anaconda3/lib/python3.7/site-packages (from category_encoders) (0.21.3)
Requirement already satisfied: patsy>=0.4.1 in /home/hironu/anaconda3/lib/python3.7/site-packages (from category_encoders) (0.5.1)
Requirement already satisfied: statsmodels>=0.6.1 in /home/hironu/anaconda3/lib/python3.7/site-packages (from category_encoders) (0.10.1)
Requirement already satisfied: numpy>=1.11.3 in /home/hironu/anaconda3/lib/python3.7/site-packages (from category_encoders) (1.17.2)
Requirement already satisfied: pandas>=0.21.1 in /home/hironu/anaconda3/lib/python3.7/site-packages (from category_encoders) (0.25.1)
Requirement already satisfied: scipy>=0.19.0 in /home/hironu/anaconda3/lib/python3.7/site-packages (from category_encoders) (1.3.1)
Requirement already satisfied: joblib>=0.11 in /home/hironu/anaconda3/lib/python3.7/site-packages (from scikit-learn>=0.20.0->category_encoders) (0.13.2)
Requirement already satisfied: six in /home/hironu/anaconda3/lib/python3.7/site-packages (from patsy>=0.4.1->category_encoders) (1.12.0)
Requirement already satisfied: python-dateutil>=2.6.1 in /home/hironu/anaconda3/lib/python3.7/site-packages (from pandas>=0.21.1->category_encoders) (2.8.0)
Requirement already satisfied: pytz>=2017.2 in /home/hironu/anaconda3/lib/python3.7/site-packages (from pandas>=0.21.1->category_encoders) (2019.3)

In [3]:
from category_encoders.one_hot import OneHotEncoder

In [4]:
train = pd.read_csv("train.csv")
test  = pd.read_csv("test.csv")

In [5]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
train.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [7]:
print(train.Age.mean(skipna=True))
print(test.Age.mean(skipna=True))

29.69911764705882
30.272590361445783

In [8]:
print(train.shape[1])
print(test.shape[1])

12
11

In [9]:
print(train.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [10]:
print(test.columns)

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [11]:
resume = train.Survived.copy()
print(resume)

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [12]:
train.drop(['Survived'],axis=1,inplace=True)
passengerId = test['PassengerId']

train_index = train.shape[0]
test_index = test.shape[0]

full = pd.concat(objs=[train,test],axis=0).reset_index(drop=True)

In [13]:
full.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [14]:
full.tail()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1304,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1305,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1306,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1307,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1308,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [15]:
full.drop(['PassengerId','Name','Cabin','Ticket'],axis=1,inplace=True)

In [16]:
full.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  22.0      1      0   7.2500        S
1       1  female  38.0      1      0  71.2833        C
2       3  female  26.0      0      0   7.9250        S
3       1  female  35.0      1      0  53.1000        S
4       3    male  35.0      0      0   8.0500        S

In [17]:
full.isnull().sum()

Pclass        0
Sex           0
Age         263
SibSp         0
Parch         0
Fare          1
Embarked      2
dtype: int64

In [18]:
avgAge = full['Age'].median()
full['Age'].fillna(avgAge,inplace=True)

avgFare = full['Fare'].median()
full['Fare'].fillna(avgFare,inplace=True)

mcEmbarked = full['Embarked'].value_counts()[0]
full['Embarked'].fillna(mcEmbarked,inplace=True)

In [19]:
full.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [20]:
full.columns

Index(['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked'], dtype='object')

In [21]:
train = full.iloc[:train_index]
test = full.iloc[:test_index]

In [22]:
test.isna().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [23]:
enc = OneHotEncoder(cols=['Pclass','Sex','Embarked'], use_cat_names=True)
enc.fit(train)

OneHotEncoder(cols=['Pclass', 'Sex', 'Embarked'], drop_invariant=False,
              handle_missing='value', handle_unknown='value', return_df=True,
              use_cat_names=True, verbose=0)

In [24]:
train_ohe = enc.transform(train)

In [25]:
train_ohe.head()

,Pclass_3.0,Pclass_1.0,Pclass_2.0,Sex_male,Sex_female,Age,SibSp,Parch,Fare,Embarked_S,Embarked_C,Embarked_Q,Embarked_914
0,1,0,0,1,0,22.0,1,0,7.2500,1,0,0,0
1,0,1,0,0,1,38.0,1,0,71.2833,0,1,0,0
2,1,0,0,0,1,26.0,0,0,7.9250,1,0,0,0
3,0,1,0,0,1,35.0,1,0,53.1000,1,0,0,0
4,1,0,0,1,0,35.0,0,0,8.0500,1,0,0,0

In [26]:
enc = OneHotEncoder(cols=['Pclass','Sex','Embarked'], use_cat_names=True)
enc.fit(test)

OneHotEncoder(cols=['Pclass', 'Sex', 'Embarked'], drop_invariant=False,
              handle_missing='value', handle_unknown='value', return_df=True,
              use_cat_names=True, verbose=0)

In [27]:
test_ohe = enc.transform(test)

In [28]:
mdl = RandomForestRegressor(n_jobs=1, n_estimators=100, random_state=22)
mdl.fit(train_ohe,resume)

RandomForestRegressor(bootstrap=True, criterion='mse', max_depth=None,
                      max_features='auto', max_leaf_nodes=None,
                      min_impurity_decrease=0.0, min_impurity_split=None,
                      min_samples_leaf=1, min_samples_split=2,
                      min_weight_fraction_leaf=0.0, n_estimators=100, n_jobs=1,
                      oob_score=False, random_state=22, verbose=0,
                      warm_start=False)

In [29]:
P_ohe = mdl.predict(test_ohe)

In [30]:
P_ohe[:5]

array([0.07, 0.99, 0.81, 1.  , 0.01])

In [31]:
from sklearn.metrics import mean_absolute_error

In [32]:
submission = pd.DataFrame({"PassengerId": passengerId,
                           "Survived":P_ohe
                          })

submission.to_csv('./submission_py.csv',index=False)